# WattsPerSquareMeter Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..WattsPerSquareMeter Property
UnitTypeId Class See Also
---
Watts per square meter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId WattsPerSquareMeter { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WattsPerSquareMeter As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ WattsPerSquareMeter {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace